formgenerator/app/Models/FormModel.php

    public function get_form($formID = null, $structure_only = true)
    {
        /*
            Arguments:
            $formID: Default value of null will fetch all form templates from the database. If a form ID is specified, fetch the specified form template from the database.
            $structure_only: Default value of true will only return the unserialised structure of forms. If false, return all form template data.
        */

        // Initialise return variables
        $forms = null;
        $form_structures = null;

        // Check if a formID was specified
        if ($formID !== null) {
            // Retrieve the specified form
            $form = $this->find($formID);
---
SELECT *
FROM `Form`
WHERE `Form`.`FormID` = 1