formgenerator/app/Models/FormTemplateModel.php

    public function getFormTemplateById($formID)
    {
        //Get form structure
        $formRow = $this->find($formID);
---
SELECT *
FROM `Form`
WHERE `Form`.`FormID` = 1

    public function newForm($data)
    {
        $this->insert($data);
---
INSERT INTO `Form` (`Name`, `Structure`) VALUES ('My KuKuBird Size Chart', 's:965:\"<form><div class=\"form-group\"><label for=\'Name\' class=\'Name-control\'>Name</label><input type=\'text\' name=\'Name\' class=\'form-control name-control\' placeholder=\'Enter your name\' required ></div><br><div class=\"form-group\"><label for=\'Message\' class=\'Message-control\'>Message</label><textarea name=\'Message\' class=\'form-control message-control\' placeholder=\'Enter your message\' required ></textarea></div><br><div class=\"form-group\"><label for=\'Sex\' class=\'sex-form\'>Sex</label><br><div class=\'checkbox-group\'><div class=\'form-check\'><input type=\'checkbox\' class=\'male_control form-check-input\' id=\'male\' name=\'male\' value=\'Male\'><label for=\'male\' class=\'male-label form-check-label\'>male</label></div><div class=\'form-check\'><input type=\'checkbox\' class=\'female_control form-check-input\' id=\'female\' name=\'female\' value=\'Female\'><label for=\'female\' class=\'female-label form-check-label\'>female</label></div></div></div><br><button type=\"submit\">Submit</button></form>\";')